test.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZFM_VP_RFQ>
         <!--You may enter the following 4 items in any order-->
         <VENDOR_ID></VENDOR_ID>
         <T_RETURN>
            <!--Zero or more repetitions:-->
            <item>
               <!--Optional:-->
               <TYPE></TYPE>
               <!--Optional:-->
               <ID></ID>
               <!--Optional:-->
               <NUMBER></NUMBER>
               <!--Optional:-->
               <MESSAGE></MESSAGE>
               <!--Optional:-->
               <LOG_NO></LOG_NO>
               <!--Optional:-->
               <LOG_MSG_NO></LOG_MSG_NO>
               <!--Optional:-->
               <MESSAGE_V1></MESSAGE_V1>
               <!--Optional:-->
               <MESSAGE_V2></MESSAGE_V2>
               <!--Optional:-->
               <MESSAGE_V3></MESSAGE_V3>
               <!--Optional:-->
               <MESSAGE_V4></MESSAGE_V4>
               <!--Optional:-->
               <PARAMETER></PARAMETER>
               <!--Optional:-->
               <ROW></ROW>
               <!--Optional:-->
               <FIELD></FIELD>
               <!--Optional:-->
               <SYSTEM></SYSTEM>
            </item>
         </T_RETURN>
         <T_RFQ_HEADER>
            <!--Zero or more repetitions:-->
            <item>
               <!--Optional:-->
               <DOC_NUMBER></DOC_NUMBER>
               <!--Optional:-->
               <CO_CODE></CO_CODE>
               <!--Optional:-->
               <DOC_CAT></DOC_CAT>
               <!--Optional:-->
               <DOC_TYPE></DOC_TYPE>
               <!--Optional:-->
               <CNTRL_IND></CNTRL_IND>
               <!--Optional:-->
               <DELETE_IND></DELETE_IND>
               <!--Optional:-->
               <STATUS></STATUS>
               <!--Optional:-->
               <CREATED_ON></CREATED_ON>
               <!--Optional:-->
               <CREATED_BY></CREATED_BY>
               <!--Optional:-->
               <ITEM_INTVL></ITEM_INTVL>
               <!--Optional:-->
               <LAST_ITEM></LAST_ITEM>
               <!--Optional:-->
               <VENDOR></VENDOR>
               <!--Optional:-->
               <LANGUAGE></LANGUAGE>
               <!--Optional:-->
               <PMNTTRMS></PMNTTRMS>
               <!--Optional:-->
               <DSCNT1_TO></DSCNT1_TO>
               <!--Optional:-->
               <DSCNT2_TO></DSCNT2_TO>
               <!--Optional:-->
               <DSCNT3_TO></DSCNT3_TO>
               <!--Optional:-->
               <CASH_DISC1></CASH_DISC1>
               <!--Optional:-->
               <CASH_DISC2></CASH_DISC2>
               <!--Optional:-->
               <PURCH_ORG></PURCH_ORG>
               <!--Optional:-->
               <PUR_GROUP></PUR_GROUP>
               <!--Optional:-->
               <CURRENCY></CURRENCY>
               <!--Optional:-->
               <EXCH_RATE></EXCH_RATE>
               <!--Optional:-->
               <EX_RATE_FX></EX_RATE_FX>
               <!--Optional:-->
               <DOC_DATE></DOC_DATE>
               <!--Optional:-->
               <VPER_START></VPER_START>
               <!--Optional:-->
               <VPER_END></VPER_END>
               <!--Optional:-->
               <APPLIC_BY></APPLIC_BY>
               <!--Optional:-->
               <QUOT_DEAD></QUOT_DEAD>
               <!--Optional:-->
               <BINDG_PER></BINDG_PER>
               <!--Optional:-->
               <WARRANTY></WARRANTY>
               <!--Optional:-->
               <BIDINV_NO></BIDINV_NO>
               <!--Optional:-->
               <QUOTATION></QUOTATION>
               <!--Optional:-->
               <QUOT_DATE></QUOT_DATE>
               <!--Optional:-->
               <REF_1></REF_1>
               <!--Optional:-->
               <SALES_PERS></SALES_PERS>
               <!--Optional:-->
               <TELEPHONE></TELEPHONE>
               <!--Optional:-->
               <SUPPL_VEND></SUPPL_VEND>
               <!--Optional:-->
               <CUSTOMER></CUSTOMER>
               <!--Optional:-->
               <AGREEMENT></AGREEMENT>
               <!--Optional:-->
               <REJ_REASON></REJ_REASON>
               <!--Optional:-->
               <COMPL_DLV></COMPL_DLV>
               <!--Optional:-->
               <GR_MESSAGE></GR_MESSAGE>
               <!--Optional:-->
               <SUPPL_PLNT></SUPPL_PLNT>
               <!--Optional:-->
               <RCVG_VEND></RCVG_VEND>
               <!--Optional:-->
               <INCOTERMS1></INCOTERMS1>
               <!--Optional:-->
               <INCOTERMS2></INCOTERMS2>
               <!--Optional:-->
               <TARGET_VAL></TARGET_VAL>
               <!--Optional:-->
               <COLL_NO></COLL_NO>
               <!--Optional:-->
               <DOC_COND></DOC_COND>
               <!--Optional:-->
               <PROCEDURE></PROCEDURE>
               <!--Optional:-->
               <UPDATE_GRP></UPDATE_GRP>
               <!--Optional:-->
               <DIFF_INV></DIFF_INV>
               <!--Optional:-->
               <EXPORT_NO></EXPORT_NO>
               <!--Optional:-->
               <OUR_REF></OUR_REF>
               <!--Optional:-->
               <LOGSYSTEM></LOGSYSTEM>
               <!--Optional:-->
               <SUBITEMINT></SUBITEMINT>
               <!--Optional:-->
               <MAST_COND></MAST_COND>
               <!--Optional:-->
               <REL_GROUP></REL_GROUP>
               <!--Optional:-->
               <REL_STRAT></REL_STRAT>
               <!--Optional:-->
               <REL_IND></REL_IND>
               <!--Optional:-->
               <REL_STATUS></REL_STATUS>
               <!--Optional:-->
               <SUBJ_TO_R></SUBJ_TO_R>
               <!--Optional:-->
               <TAXR_CNTRY></TAXR_CNTRY>
               <!--Optional:-->
               <SCHED_IND></SCHED_IND>
               <!--Optional:-->
               <VEND_NAME></VEND_NAME>
               <!--Optional:-->
               <CURRENCY_ISO></CURRENCY_ISO>
               <!--Optional:-->
               <EXCH_RATE_CM></EXCH_RATE_CM>
               <!--Optional:-->
               <TRNSP_MODE></TRNSP_MODE>
               <!--Optional:-->
               <CUSTOMS></CUSTOMS>
            </item>
         </T_RFQ_HEADER>
         <T_RFQ_ITEMS>
            <!--Zero or more repetitions:-->
            <item>
               <!--Optional:-->
               <DOC_NUMBER></DOC_NUMBER>
               <!--Optional:-->
               <DOC_ITEM></DOC_ITEM>
               <!--Optional:-->
               <DELETE_IND></DELETE_IND>
               <!--Optional:-->
               <STATUS></STATUS>
               <!--Optional:-->
               <CHANGED_ON></CHANGED_ON>
               <!--Optional:-->
               <SHORT_TEXT></SHORT_TEXT>
               <!--Optional:-->
               <MATERIAL></MATERIAL>
               <!--Optional:-->
               <PUR_MAT></PUR_MAT>
               <!--Optional:-->
               <CO_CODE></CO_CODE>
               <!--Optional:-->
               <PLANT></PLANT>
               <!--Optional:-->
               <STORE_LOC></STORE_LOC>
               <!--Optional:-->
               <TRACKINGNO></TRACKINGNO>
               <!--Optional:-->
               <MAT_GRP></MAT_GRP>
               <!--Optional:-->
               <INFO_REC></INFO_REC>
               <!--Optional:-->
               <VEND_MAT></VEND_MAT>
               <!--Optional:-->
               <TARGET_QTY></TARGET_QTY>
               <!--Optional:-->
               <QUANTITY></QUANTITY>
               <!--Optional:-->
               <UNIT></UNIT>
               <!--Optional:-->
               <ORDERPR_UN></ORDERPR_UN>
               <!--Optional:-->
               <CONV_NUM1></CONV_NUM1>
               <!--Optional:-->
               <CONV_DEN1></CONV_DEN1>
               <!--Optional:-->
               <CONV_NUM2></CONV_NUM2>
               <!--Optional:-->
               <CONV_DEN2></CONV_DEN2>
               <!--Optional:-->
               <NET_PRICE></NET_PRICE>
               <!--Optional:-->
               <PRICE_UNIT></PRICE_UNIT>
               <!--Optional:-->
               <NET_VALUE></NET_VALUE>
               <!--Optional:-->
               <GROS_VALUE></GROS_VALUE>
               <!--Optional:-->
               <QUOT_DEAD></QUOT_DEAD>
               <!--Optional:-->
               <GR_PR_TIME></GR_PR_TIME>
               <!--Optional:-->
               <TAX_CODE></TAX_CODE>
               <!--Optional:-->
               <SETT_GRP1></SETT_GRP1>
               <!--Optional:-->
               <QUAL_INSP></QUAL_INSP>
               <!--Optional:-->
               <INFO_UPD></INFO_UPD>
               <!--Optional:-->
               <PRNT_PRICE></PRNT_PRICE>
               <!--Optional:-->
               <EST_PRICE></EST_PRICE>
               <!--Optional:-->
               <NUM_REMIND></NUM_REMIND>
               <!--Optional:-->
               <REMINDER1></REMINDER1>
               <!--Optional:-->
               <REMINDER2></REMINDER2>
               <!--Optional:-->
               <REMINDER3></REMINDER3>
               <!--Optional:-->
               <OVERDELTOL></OVERDELTOL>
               <!--Optional:-->
               <UNLIMITED></UNLIMITED>
               <!--Optional:-->
               <UNDER_TOL></UNDER_TOL>
               <!--Optional:-->
               <VAL_TYPE></VAL_TYPE>
               <!--Optional:-->
               <VAL_CAT></VAL_CAT>
               <!--Optional:-->
               <REJ_IND></REJ_IND>
               <!--Optional:-->
               <COMMENT></COMMENT>
               <!--Optional:-->
               <DEL_COMPL></DEL_COMPL>
               <!--Optional:-->
               <FINAL_INV></FINAL_INV>
               <!--Optional:-->
               <ITEM_CAT></ITEM_CAT>
               <!--Optional:-->
               <ACCTASSCAT></ACCTASSCAT>
               <!--Optional:-->
               <CONSUMPT></CONSUMPT>
               <!--Optional:-->
               <DISTRIB></DISTRIB>
               <!--Optional:-->
               <PART_INV></PART_INV>
               <!--Optional:-->
               <GR_IND></GR_IND>
               <!--Optional:-->
               <GR_NON_VAL></GR_NON_VAL>
               <!--Optional:-->
               <IR_IND></IR_IND>
               <!--Optional:-->
               <GR_BASEDIV></GR_BASEDIV>
               <!--Optional:-->
               <ACKN_REQD></ACKN_REQD>
               <!--Optional:-->
               <ACKNOWL_NO></ACKNOWL_NO>
               <!--Optional:-->
               <AGREEMENT></AGREEMENT>
               <!--Optional:-->
               <AGMT_ITEM></AGMT_ITEM>
               <!--Optional:-->
               <RECON_DATE></RECON_DATE>
               <!--Optional:-->
               <AGRCUMQTY></AGRCUMQTY>
               <!--Optional:-->
               <FIRM_ZONE></FIRM_ZONE>
               <!--Optional:-->
               <TRADE_OFF></TRADE_OFF>
               <!--Optional:-->
               <BOM_EXPL></BOM_EXPL>
               <!--Optional:-->
               <EXCLUSION></EXCLUSION>
               <!--Optional:-->
               <BASE_UNIT></BASE_UNIT>
               <!--Optional:-->
               <SHIPPING></SHIPPING>
               <!--Optional:-->
               <OUTL_TARGV></OUTL_TARGV>
               <!--Optional:-->
               <NOND_ITAX></NOND_ITAX>
               <!--Optional:-->
               <RELORD_QTY></RELORD_QTY>
               <!--Optional:-->
               <PRICE_DATE></PRICE_DATE>
               <!--Optional:-->
               <DOC_CAT></DOC_CAT>
               <!--Optional:-->
               <EFF_VALUE></EFF_VALUE>
               <!--Optional:-->
               <COMMITMENT></COMMITMENT>
               <!--Optional:-->
               <CUSTOMER></CUSTOMER>
               <!--Optional:-->
               <ADDRESS></ADDRESS>
               <!--Optional:-->
               <COND_GROUP></COND_GROUP>
               <!--Optional:-->
               <NO_C_DISC></NO_C_DISC>
               <!--Optional:-->
               <UPDATE_GRP></UPDATE_GRP>
               <!--Optional:-->
               <PLAN_DEL></PLAN_DEL>
               <!--Optional:-->
               <NET_WEIGHT></NET_WEIGHT>
               <!--Optional:-->
               <WEIGHTUNIT></WEIGHTUNIT>
               <!--Optional:-->
               <TAX_JUR_CD></TAX_JUR_CD>
               <!--Optional:-->
               <PRINT_REL></PRINT_REL>
               <!--Optional:-->
               <SPEC_STOCK></SPEC_STOCK>
               <!--Optional:-->
               <SETRESERNO></SETRESERNO>
               <!--Optional:-->
               <SETTLITMNO></SETTLITMNO>
               <!--Optional:-->
               <NOT_CHGBL></NOT_CHGBL>
               <!--Optional:-->
               <CTR_KEY_QM></CTR_KEY_QM>
               <!--Optional:-->
               <CERT_TYPE></CERT_TYPE>
               <!--Optional:-->
               <EAN_UPC></EAN_UPC>
               <!--Optional:-->
               <CONF_CTRL></CONF_CTRL>
               <!--Optional:-->
               <REV_LEV></REV_LEV>
               <!--Optional:-->
               <FUND></FUND>
               <!--Optional:-->
               <FUNDS_CTR></FUNDS_CTR>
               <!--Optional:-->
               <CMMT_ITEM></CMMT_ITEM>
               <!--Optional:-->
               <BA_PARTNER></BA_PARTNER>
               <!--Optional:-->
               <PTR_ASS_BA></PTR_ASS_BA>
               <!--Optional:-->
               <PROFIT_CTR></PROFIT_CTR>
               <!--Optional:-->
               <PARTNER_PC></PARTNER_PC>
               <!--Optional:-->
               <PRICE_CTR></PRICE_CTR>
               <!--Optional:-->
               <GROSS_WGHT></GROSS_WGHT>
               <!--Optional:-->
               <VOLUME></VOLUME>
               <!--Optional:-->
               <VOLUMEUNIT></VOLUMEUNIT>
               <!--Optional:-->
               <INCOTERMS1></INCOTERMS1>
               <!--Optional:-->
               <INCOTERMS2></INCOTERMS2>
               <!--Optional:-->
               <ADVANCE></ADVANCE>
               <!--Optional:-->
               <PRIOR_VEND></PRIOR_VEND>
               <!--Optional:-->
               <SUB_RANGE></SUB_RANGE>
               <!--Optional:-->
               <PCKG_NO></PCKG_NO>
               <!--Optional:-->
               <STATISTIC></STATISTIC>
               <!--Optional:-->
               <HL_ITEM></HL_ITEM>
               <!--Optional:-->
               <GR_TO_DATE></GR_TO_DATE>
               <!--Optional:-->
               <SUPPL_VEND></SUPPL_VEND>
               <!--Optional:-->
               <SC_VENDOR></SC_VENDOR>
               <!--Optional:-->
               <CONF_MATL></CONF_MATL>
               <!--Optional:-->
               <MAT_CAT></MAT_CAT>
               <!--Optional:-->
               <KANBAN_IND></KANBAN_IND>
               <!--Optional:-->
               <ADDRESS2></ADDRESS2>
               <!--Optional:-->
               <INT_OBJ_NO></INT_OBJ_NO>
               <!--Optional:-->
               <ERS></ERS>
               <!--Optional:-->
               <GRSETTFROM></GRSETTFROM>
               <!--Optional:-->
               <LAST_TRANS></LAST_TRANS>
               <!--Optional:-->
               <TRANS_TIME></TRANS_TIME>
               <!--Optional:-->
               <SER_NO></SER_NO>
               <!--Optional:-->
               <PROMOTION></PROMOTION>
               <!--Optional:-->
               <ALLOC_TBL></ALLOC_TBL>
               <!--Optional:-->
               <AT_ITEM></AT_ITEM>
               <!--Optional:-->
               <POINTS></POINTS>
               <!--Optional:-->
               <POINTS_UN></POINTS_UN>
               <!--Optional:-->
               <SEASON_TY></SEASON_TY>
               <!--Optional:-->
               <SEASON_YR></SEASON_YR>
               <!--Optional:-->
               <SETT_GRP_2></SETT_GRP_2>
               <!--Optional:-->
               <SETT_GRP_3></SETT_GRP_3>
               <!--Optional:-->
               <SETT_ITEM></SETT_ITEM>
               <!--Optional:-->
               <ML_AKT></ML_AKT>
               <!--Optional:-->
               <REMSHLIFE></REMSHLIFE>
               <!--Optional:-->
               <RFQ></RFQ>
               <!--Optional:-->
               <RFQ_ITEM></RFQ_ITEM>
               <!--Optional:-->
               <CONFIG_ORG></CONFIG_ORG>
               <!--Optional:-->
               <QUOTAUSAGE></QUOTAUSAGE>
               <!--Optional:-->
               <SPSTCK_PHY></SPSTCK_PHY>
               <!--Optional:-->
               <PREQ_NO></PREQ_NO>
               <!--Optional:-->
               <PREQ_ITEM></PREQ_ITEM>
               <!--Optional:-->
               <MAT_TYPE></MAT_TYPE>
               <!--Optional:-->
               <SI_CAT></SI_CAT>
               <!--Optional:-->
               <SUB_ITEMS></SUB_ITEMS>
               <!--Optional:-->
               <SUBTOTAL_1></SUBTOTAL_1>
               <!--Optional:-->
               <SUBTOTAL_2></SUBTOTAL_2>
               <!--Optional:-->
               <SUBTOTAL_3></SUBTOTAL_3>
               <!--Optional:-->
               <SUBTOTAL_4></SUBTOTAL_4>
               <!--Optional:-->
               <SUBTOTAL_5></SUBTOTAL_5>
               <!--Optional:-->
               <SUBTOTAL_6></SUBTOTAL_6>
               <!--Optional:-->
               <SUBITM_KEY></SUBITM_KEY>
               <!--Optional:-->
               <MAX_CMG></MAX_CMG>
               <!--Optional:-->
               <MAX_CPGO></MAX_CPGO>
               <!--Optional:-->
               <RET_ITEM></RET_ITEM>
               <!--Optional:-->
               <AT_RELEV></AT_RELEV>
               <!--Optional:-->
               <ORD_REAS></ORD_REAS>
               <!--Optional:-->
               <DEL_TYP_RT></DEL_TYP_RT>
               <!--Optional:-->
               <PRDTE_CTRL></PRDTE_CTRL>
               <!--Optional:-->
               <MANUF_PROF></MANUF_PROF>
               <!--Optional:-->
               <MANU_MAT></MANU_MAT>
               <!--Optional:-->
               <MFR_NO></MFR_NO>
               <!--Optional:-->
               <MFR_NO_EXT></MFR_NO_EXT>
               <!--Optional:-->
               <ITEM_CAT_EXT></ITEM_CAT_EXT>
               <!--Optional:-->
               <PO_UNIT_ISO></PO_UNIT_ISO>
               <!--Optional:-->
               <ORDERPR_UN_ISO></ORDERPR_UN_ISO>
               <!--Optional:-->
               <BASE_UOM_ISO></BASE_UOM_ISO>
               <!--Optional:-->
               <WEIGHTUNIT_ISO></WEIGHTUNIT_ISO>
               <!--Optional:-->
               <VOLUMEUNIT_ISO></VOLUMEUNIT_ISO>
               <!--Optional:-->
               <POINTS_UN_ISO></POINTS_UN_ISO>
               <!--Optional:-->
               <PREQ_NAME></PREQ_NAME>
               <!--Optional:-->
               <BUS_TRANST></BUS_TRANST>
               <!--Optional:-->
               <EXPIMPPROC></EXPIMPPROC>
               <!--Optional:-->
               <COMM_CODE></COMM_CODE>
               <!--Optional:-->
               <REG_ORIGIN></REG_ORIGIN>
               <!--Optional:-->
               <COUNT_ORIG></COUNT_ORIG>
               <!--Optional:-->
               <PO_PRICE></PO_PRICE>
               <!--Optional:-->
               <NO_ROUNDING></NO_ROUNDING>
            </item>
         </T_RFQ_ITEMS>
      </urn:ZFM_VP_RFQ>
   </soapenv:Body>
</soapenv:Envelope>